In [3]:
import numpy as np
import pandas as pd

df_1 = pd.DataFrame()
df_2 = pd.DataFrame()

costs_1 = np.random.randint(10, 100, size=(100,))
costs_2 = np.random.randint(10, 100, size=(100,))
sales_1 = np.random.randint(10, 100, size=(100,))
sales_2 = np.random.randint(10, 100, size=(100,))
df_1['cost'] = costs_1
df_2['cost'] = costs_2

df_1['sale'] = sales_1
df_2['sale'] = sales_2

In [5]:
df_1.head()

   cost  sale
0    63    77
1    78    69
2    65    21
3    40    70
4    37    16

In [6]:
df_2.head()

   cost  sale
0    54    54
1    10    33
2    83    35
3    47    49
4    62    51

In [8]:
set(df_2['cost']) - set(df_1['cost'])

{18,
 21,
 22,
 23,
 26,
 28,
 30,
 33,
 34,
 38,
 39,
 47,
 48,
 50,
 54,
 55,
 57,
 62,
 64,
 72,
 82,
 91}

In [ ]:
for i, r in df_1: